{
  "restaurants": [
      {
          "id": 1,
          "name": "Centro Taco Bar",
          "image": "centro-logo.png",
          "price": "$",
          "distance": "1 mi",
          "description": "Centro Taco Bar offers a vibrant atmosphere with a menu focused on fresh, made-to-order tacos and other Mexican delights. It's a local favorite for both dine-in and takeout, perfect for a quick and delicious meal."
      },
      {
          "id": 2,
          "name": "Cabo Fish Taco",
          "image": "cabo-fish-taco-logo.png",
          "price": "$$",
          "distance": "1 mi",
          "description": "Cabo Fish Taco specializes in fresh seafood tacos, blending coastal flavors with a casual dining experience. The laid-back vibe and outdoor seating make it an ideal spot for enjoying a sunny day."
      },
      {
          "id": 3,
          "name": "PK's Pizza",
          "image": "PKs-logo.png",
          "price": "$",
          "distance": "1 mi",
          "description": "PK's Pizza is renowned for its late-night slices and hearty pizzas, making it a popular choice among students. With a welcoming atmosphere, it’s the perfect spot for grabbing a quick bite after a night out."
      },
      {
          "id": 4,
          "name": "Sharkey's",
          "image": "sharkeys-logo.png",
          "price": "$",
          "distance": "1 mi",
          "description": "Sharkey's offers a diverse menu featuring burgers, sandwiches, and seafood in a lively bar setting. Known for its friendly service and vibrant nightlife, it's a great place to unwind with friends."
      },
      {
          "id": 5,
          "name": "Gaucho Brazilian Grille",
          "image": "gaucho-logo.png",
          "price": "$$",
          "distance": "1 mi",
          "description": "Gaucho Brazilian Grille presents an authentic Brazilian dining experience with its rodizio-style service and a variety of grilled meats. The upscale atmosphere makes it perfect for special occasions or a memorable night out."
      },
      {
          "id": 6,
          "name": "Souvlaki",
          "image": "souvlaki-logo.png",
          "price": "$",
          "distance": "0.5 mi",
          "description": "Souvlaki is a charming eatery specializing in Greek cuisine, particularly its namesake dish, skewered meats grilled to perfection. The cozy atmosphere and flavorful dishes make it a must-try for lovers of Mediterranean fare."
      },
      {
          "id": 7,
          "name": "Hello Bagel",
          "image": "hello-bagel-logo.png",
          "price": "$",
          "distance": "1.5 mi",
          "description": "Hello Bagel offers a delightful selection of fresh bagels, spreads, and breakfast sandwiches, perfect for a quick and satisfying meal. Its friendly service and relaxed vibe make it a favorite among students and locals alike."
      },
      {
          "id": 8,
          "name": "El Bronco Mexican Bar & Grill",
          "image": "el-bronco-logo.png",
          "price": "$",
          "distance": "8.5 mi",
          "description": "El Bronco Mexican Bar & Grill features a vibrant atmosphere and a menu filled with traditional Mexican dishes and drinks. Known for its lively ambiance, it's a great place to enjoy a festive night out."
      },
      {
          "id": 9,
          "name": "Dude's Drive In",
          "image": "dudes-drive-in-logo.png",
          "price": "$",
          "distance": "10 mi",
          "description": "Dude's Drive In serves classic American fare, including burgers and milkshakes, in a nostalgic drive-in setting. It's a fun spot to relive retro dining while enjoying delicious comfort food."
      },
      {
          "id": 10,
          "name": "Himalayan Curry Cafe",
          "image": "himalayan-cafe-logo.png",
          "price": "$",
          "distance": "1.5 mi",
          "description": "Himalayan Curry Cafe specializes in flavorful and aromatic dishes from the Himalayan region, with an emphasis on fresh ingredients and spices. The welcoming atmosphere makes it a great choice for a casual dining experience."
      },
      {
          "id": 11,
          "name": "Green's Grill & Sushi",
          "image": "greens-grill-sushi-logo.png",
          "price": "$$",
          "distance": "1 mi",
          "description": "Green's Grill & Sushi offers a fusion of fresh sushi and grilled dishes in a modern setting. It's well-loved for its quality ingredients and diverse menu, perfect for both sushi enthusiasts and grill lovers."
      },
      {
          "id": 12,
          "name": "Mellow Mushroom",
          "image": "mellow-mushroom-logo.png",
          "price": "$$",
          "distance": "1 mi",
          "description": "Mellow Mushroom is a laid-back pizza joint offering creative pizzas, craft beers, and a colorful, artistic atmosphere. It’s a go-to spot for students and locals alike, especially for casual nights out with friends."
      }
  ]
}